app/Services/AlertService.php

    public function getActiveAlerts($limit = null, $userId = null)
    {
        $builder = $this->alertModel
            ->where('is_resolved', 0);

        if ($userId) {
            $builder->where('user_id', $userId);
        }

        $builder->orderBy('severity', 'DESC')
            ->orderBy('created_at', 'DESC');

        if ($limit) {
            return $builder->findAll($limit);
        }

        return $builder->findAll();
---
SELECT *
FROM `alerts`
WHERE `is_resolved` = 0
ORDER BY `severity` DESC, `created_at` DESC