app/Services/AssignmentService.php

    public function getActiveTaskCount($userId)
    {
        return $this->taskModel
            ->where('assigned_to', $userId)
            ->whereIn('status', ['todo', 'in_progress', 'review'])
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tasks`
WHERE `assigned_to` = '5'
AND `status` IN ('todo','in_progress','review')
AND `deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL

    public function getWeeklyHours($userId)
    {
        $startOfWeek = date('Y-m-d', strtotime('monday this week'));
        $endOfWeek = date('Y-m-d', strtotime('sunday this week'));

        $result = $this->timeEntryModel
            ->selectSum('hours')
            ->where('user_id', $userId)
            ->where('date >=', $startOfWeek)
            ->where('date <=', $endOfWeek)
            ->first();
---
SELECT SUM(`hours`) AS `hours`
FROM `time_entries`
WHERE `user_id` = '5'
AND `date` >= '2026-02-02'
AND `date` <= '2026-02-08'
AND `time_entries`.`deleted_at` IS NULL
 LIMIT 1

    public function getTasksByStatus($userId)
    {
        $tasks = $this->taskModel
            ->select('status, COUNT(*) as count')
            ->where('assigned_to', $userId)
            ->groupBy('status')
            ->findAll();
---
SELECT `status`, COUNT(*) as count
FROM `tasks`
WHERE `assigned_to` = '5'
AND `deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL
GROUP BY `status`

    public function getAllDevelopersWorkload($projectId = null)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('users')
            ->select('users.id, users.username')
            ->join('auth_groups_users', 'auth_groups_users.user_id = users.id')
            ->where('auth_groups_users.group', 'developer');

        if ($projectId) {
            $builder->join('project_users', 'project_users.user_id = users.id')
                ->where('project_users.project_id', $projectId);
        }

        $developers = $builder->get()->getResultArray();
---
SELECT `users`.`id`, `users`.`username`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
WHERE `auth_groups_users`.`group` = 'developer'