app/Services/CapacityService.php

    protected function getCurrentCapacity()
    {
        $db = \Config\Database::connect();

        $developerCount = $db->table('users')
            ->join('auth_groups_users', 'auth_groups_users.user_id = users.id')
            ->where('auth_groups_users.group', 'developer')
            ->where('users.active', 1)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
WHERE `auth_groups_users`.`group` = 'developer'
AND `users`.`active` = 1

    protected function getDemand()
    {
        $activeTasks = $this->taskModel
            ->whereIn('status', ['backlog', 'todo', 'in_progress', 'review'])
            ->where('deleted_at', null)
            ->findAll();
---
SELECT *
FROM `tasks`
WHERE `status` IN ('backlog','todo','in_progress','review')
AND `deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL

    protected function getUtilization()
    {
        $startOfWeek = date('Y-m-d', strtotime('monday this week'));
        $endOfWeek = date('Y-m-d', strtotime('sunday this week'));

        $weeklyHours = $this->timeEntryModel
            ->selectSum('hours')
            ->where('date >=', $startOfWeek)
            ->where('date <=', $endOfWeek)
            ->first();
---
SELECT SUM(`hours`) AS `hours`
FROM `time_entries`
WHERE `date` >= '2026-02-02'
AND `date` <= '2026-02-08'
AND `time_entries`.`deleted_at` IS NULL
 LIMIT 1

    public function getProjectCapacityAllocation()
    {
        $projects = $this->projectModel
            ->where('status', 'active')
            ->where('deleted_at', null)
            ->findAll();

        $allocations = [];

        foreach ($projects as $project) {
            $tasks = $this->taskModel
                ->where('project_id', $project['id'])
                ->whereIn('status', ['backlog', 'todo', 'in_progress', 'review'])
                ->where('deleted_at', null)
                ->findAll();
---
SELECT *
FROM `projects`
WHERE `status` = 'active'
AND `deleted_at` IS NULL
AND `projects`.`deleted_at` IS NULL
SELECT *
FROM `tasks`
WHERE `project_id` = '1'
AND `status` IN ('backlog','todo','in_progress','review')
AND `deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL