app/Services/DashboardService.php

SELECT `tasks`.*, `projects`.`name` as `project_name`
FROM `tasks`
JOIN `projects` ON `projects`.`id` = `tasks`.`project_id`
WHERE `tasks`.`is_blocked` = 1
AND `tasks`.`deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL
SELECT `tasks`.*, `projects`.`name` as `project_name`, `users`.`username`
FROM `tasks`
JOIN `projects` ON `projects`.`id` = `tasks`.`project_id`
LEFT JOIN `users` ON `users`.`id` = `tasks`.`assigned_to`
WHERE `tasks`.`deadline` < '2026-02-04'
AND `tasks`.`status` != 'done'
AND `tasks`.`deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL
ORDER BY `tasks`.`deadline` ASC
 LIMIT 5
---
    public function getCriticalAlerts()
    {
        $alerts = [];

        $blockedTasks = $this->taskModel
            ->select('tasks.*, projects.name as project_name')
            ->join('projects', 'projects.id = tasks.project_id')
            ->where('tasks.is_blocked', 1)
            ->where('tasks.deleted_at', null)
            ->findAll();

        foreach ($blockedTasks as $task) {
            $alerts[] = [
                'type' => 'blocker',
                'severity' => 'critical',
                'message' => "Task '{$task['title']}' in {$task['project_name']} is blocked",
                'link' => "/tasks/view/{$task['id']}",
                'created_at' => $task['updated_at'],
            ];
        }

        $overdueTasks = $this->taskModel
            ->select('tasks.*, projects.name as project_name, users.username')
            ->join('projects', 'projects.id = tasks.project_id')
            ->join('users', 'users.id = tasks.assigned_to', 'left')
            ->where('tasks.deadline <', date('Y-m-d'))
            ->where('tasks.status !=', 'done')
            ->where('tasks.deleted_at', null)
            ->orderBy('tasks.deadline', 'ASC')
            ->findAll(5);

SELECT `tasks`.*, `projects`.`name` as `project_name`
FROM `tasks`
JOIN `projects` ON `projects`.`id` = `tasks`.`project_id`
WHERE `tasks`.`assigned_to` IS NULL
AND `tasks`.`status` IN ('todo','in_progress')
AND `tasks`.`deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL
---
            ];
        }

        $unassignedTasks = $this->taskModel
            ->select('tasks.*, projects.name as project_name')
            ->join('projects', 'projects.id = tasks.project_id')
            ->where('tasks.assigned_to', null)
            ->whereIn('tasks.status', ['todo', 'in_progress'])
            ->where('tasks.deleted_at', null)
            ->findAll();

SELECT `activity_logs`.*, `users`.`username`
FROM `activity_logs`
JOIN `users` ON `users`.`id` = `activity_logs`.`user_id`
ORDER BY `activity_logs`.`created_at` DESC
 LIMIT 10
---
    public function getRecentActivity($limit = 10)
    {
        return $this->activityLogModel
            ->select('activity_logs.*, users.username')
            ->join('users', 'users.id = activity_logs.user_id')
            ->orderBy('activity_logs.created_at', 'DESC')
            ->findAll($limit);

SELECT `users`.`id`, `users`.`username`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
WHERE `auth_groups_users`.`group` = 'developer'
SELECT COUNT(*) AS `numrows`
FROM `tasks`
WHERE `assigned_to` = '5'
AND `status` = 'done'
AND `completed_at` >= '2026-01-05'
AND `tasks`.`deleted_at` IS NULL
SELECT SUM(`hours`) AS `hours`
FROM `time_entries`
WHERE `user_id` = '5'
AND `date` >= '2026-01-05'
AND `time_entries`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getTeamPerformance()
    {
        $db = \Config\Database::connect();

        $developers = $db->table('users')
            ->select('users.id, users.username')
            ->join('auth_groups_users', 'auth_groups_users.user_id = users.id')
            ->where('auth_groups_users.group', 'developer')
            ->get()
            ->getResultArray();

        $performance = [];
        foreach ($developers as $dev) {
            $tasksCompleted = $this->taskModel
                ->where('assigned_to', $dev['id'])
                ->where('status', 'done')
                ->where('completed_at >=', date('Y-m-d', strtotime('-30 days')))
                ->countAllResults();

            $hoursLogged = $this->timeEntryModel
                ->selectSum('hours')
                ->where('user_id', $dev['id'])
                ->where('date >=', date('Y-m-d', strtotime('-30 days')))
                ->first();

SELECT `tasks`.*, `projects`.`name` as `project_name`, `users`.`username`
FROM `tasks`
JOIN `projects` ON `projects`.`id` = `tasks`.`project_id`
LEFT JOIN `users` ON `users`.`id` = `tasks`.`assigned_to`
WHERE `tasks`.`deadline` >= '2026-02-04'
AND `tasks`.`deadline` <= '2026-02-11'
AND `tasks`.`status` != 'done'
AND `tasks`.`deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL
ORDER BY `tasks`.`deadline` ASC
---
    public function getDeadlineOverview()
    {
        $upcoming = $this->taskModel
            ->select('tasks.*, projects.name as project_name, users.username')
            ->join('projects', 'projects.id = tasks.project_id')
            ->join('users', 'users.id = tasks.assigned_to', 'left')
            ->where('tasks.deadline >=', date('Y-m-d'))
            ->where('tasks.deadline <=', date('Y-m-d', strtotime('+7 days')))
            ->where('tasks.status !=', 'done')
            ->where('tasks.deleted_at', null)
            ->orderBy('tasks.deadline', 'ASC')
            ->findAll();

SELECT `tasks`.*, `projects`.`name` as `project_name`
FROM `tasks`
JOIN `projects` ON `projects`.`id` = `tasks`.`project_id`
WHERE `tasks`.`assigned_to` = 5
AND `tasks`.`status` != 'done'
AND `tasks`.`deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL
ORDER BY `tasks`.`priority` DESC, `tasks`.`deadline` ASC
SELECT `projects`.*
FROM `projects`
JOIN `project_users` ON `project_users`.`project_id` = `projects`.`id`
WHERE `project_users`.`user_id` = 5
AND `projects`.`deleted_at` IS NULL
AND `projects`.`deleted_at` IS NULL
ORDER BY `projects`.`status` ASC
SELECT `activity_logs`.*, `users`.`username`
FROM `activity_logs`
JOIN `users` ON `users`.`id` = `activity_logs`.`user_id`
ORDER BY `activity_logs`.`created_at` DESC
 LIMIT 10
---
    public function getDeveloperDashboard($userId)
    {
        $myTasks = $this->taskModel
            ->select('tasks.*, projects.name as project_name')
            ->join('projects', 'projects.id = tasks.project_id')
            ->where('tasks.assigned_to', $userId)
            ->whereIn('tasks.status', ['backlog', 'todo', 'in_progress', 'review'])
            ->where('tasks.deleted_at', null)
            ->orderBy('tasks.status', 'ASC')
            ->orderBy('tasks.priority', 'DESC')
            ->orderBy('tasks.deadline', 'ASC')
            ->findAll();

        $myProjects = $this->projectModel
            ->select('projects.*')
            ->join('project_users', 'project_users.project_id = projects.id')
            ->where('project_users.user_id', $userId)
            ->where('projects.deleted_at', null)
            ->orderBy('projects.status', 'ASC')
            ->findAll();

        $recentActivity = $this->activityLogModel
            ->select('activity_logs.*, users.username')
            ->join('users', 'users.id = activity_logs.user_id')
            ->orderBy('activity_logs.created_at', 'DESC')
            ->findAll(10);