app/Services/DashboardService.php

SELECT `projects`.*
FROM `projects`
JOIN `project_users` ON `project_users`.`project_id` = `projects`.`id`
WHERE `project_users`.`user_id` = 5
AND `projects`.`deleted_at` IS NULL
AND `projects`.`deleted_at` IS NULL
---
    public function getDeveloperDashboard($userId)
    {
        $myTasks = $this->taskModel
            ->select('tasks.*, projects.name as project_name')
            ->join('projects', 'projects.id = tasks.project_id')
            ->where('tasks.assigned_to', $userId)
            ->where('tasks.status !=', 'done')
            ->where('tasks.deleted_at', null)
            ->orderBy('tasks.priority', 'DESC')
            ->orderBy('tasks.deadline', 'ASC')
            ->findAll();

        $myProjects = $this->projectModel
            ->select('projects.*')
            ->join('project_users', 'project_users.project_id = projects.id')
            ->where('project_users.user_id', $userId)
            ->where('projects.deleted_at', null)
            ->findAll();