app/Controllers/MessagesController.php

    public function index($projectId)
    {
        $project = $this->projectModel->find($projectId);
---
SELECT *
FROM `projects`
WHERE `projects`.`deleted_at` IS NULL
AND `projects`.`id` = '1'

    public function store()
    {
        $data = $this->request->getPost();
        $data['user_id'] = auth()->id();

        if (!$this->messageModel->insert($data)) {
---
INSERT INTO `messages` (`project_id`, `message`, `user_id`, `created_at`, `updated_at`) VALUES ('1', 'Hi', 5, '2026-02-04 14:50:37', '2026-02-04 14:50:37')