app/Controllers/NotesController.php

    public function index()
    {
        try {
            $user = auth()->user();
            $isAdmin = $user->inGroup('admin');
            $projectId = $this->request->getGet('project_id');
            $taskId = $this->request->getGet('task_id');

            if ($projectId) {
                $notes = $this->noteModel->getProjectNotes($projectId);
                $context = $this->projectModel->find($projectId);
                $contextType = 'project';
            } elseif ($taskId) {
                $notes = $this->noteModel->getTaskNotes($taskId);
                $context = $this->taskModel->find($taskId);
                $contextType = 'task';
            } else {
                // Show all notes for the user
                $notes = $this->noteModel
                    ->select('notes.*, projects.name as project_name, tasks.title as task_title, users.username')
                    ->join('users', 'users.id = notes.user_id')
                    ->join('projects', 'projects.id = notes.project_id', 'left')
                    ->join('tasks', 'tasks.id = notes.task_id', 'left')
                    ->where('notes.user_id', $user->id)
                    ->orderBy('notes.created_at', 'DESC')
                    ->findAll();
---
SELECT `notes`.*, `projects`.`name` as `project_name`, `tasks`.`title` as `task_title`, `users`.`username`
FROM `notes`
JOIN `users` ON `users`.`id` = `notes`.`user_id`
LEFT JOIN `projects` ON `projects`.`id` = `notes`.`project_id`
LEFT JOIN `tasks` ON `tasks`.`id` = `notes`.`task_id`
WHERE `notes`.`user_id` = 5
AND `notes`.`deleted_at` IS NULL
ORDER BY `notes`.`created_at` DESC