app/Controllers/ProjectsController.php

    public function view($id)
    {
        $user = auth()->user();
        $isAdmin = $user->inGroup('admin');

        $projectModel = new ProjectModel();
        $project = $projectModel->find($id);
---
SELECT *
FROM `projects`
WHERE `projects`.`deleted_at` IS NULL
AND `projects`.`id` = '1'