app/Controllers/TimeEntriesController.php

    public function tracker()
    {
        $taskModel = new TaskModel();
        $timeModel = new TimeEntryModel();
        $userId = auth()->id();

        $myTasks = $taskModel
            ->select('tasks.*, projects.name as project_name')
            ->join('projects', 'projects.id = tasks.project_id')
            ->where('tasks.assigned_to', $userId)
            ->whereIn('tasks.status', ['backlog', 'todo', 'in_progress', 'review'])
            ->where('tasks.deleted_at', null)
            ->orderBy('tasks.status', 'ASC')
            ->orderBy('tasks.priority', 'DESC')
            ->findAll();

        $recentEntries = $timeModel
            ->select('time_entries.*, tasks.title as task_title, projects.name as project_name')
            ->join('tasks', 'tasks.id = time_entries.task_id', 'left')
            ->join('projects', 'projects.id = tasks.project_id', 'left')
            ->where('time_entries.user_id', $userId)
            ->orderBy('time_entries.date', 'DESC')
            ->orderBy('time_entries.created_at', 'DESC')
            ->findAll(20);

        $todayHours = $timeModel
            ->selectSum('hours')
            ->where('user_id', $userId)
            ->where('date', date('Y-m-d'))
            ->first();
---
SELECT `tasks`.*, `projects`.`name` as `project_name`
FROM `tasks`
JOIN `projects` ON `projects`.`id` = `tasks`.`project_id`
WHERE `tasks`.`assigned_to` = 5
AND `tasks`.`status` IN ('todo','in_progress','review')
AND `tasks`.`deleted_at` IS NULL
AND `tasks`.`deleted_at` IS NULL
SELECT `time_entries`.*, `tasks`.`title` as `task_title`, `projects`.`name` as `project_name`
FROM `time_entries`
LEFT JOIN `tasks` ON `tasks`.`id` = `time_entries`.`task_id`
LEFT JOIN `projects` ON `projects`.`id` = `tasks`.`project_id`
WHERE `time_entries`.`user_id` = 5
AND `time_entries`.`deleted_at` IS NULL
ORDER BY `time_entries`.`date` DESC, `time_entries`.`created_at` DESC
 LIMIT 20
SELECT SUM(`hours`) AS `hours`
FROM `time_entries`
WHERE `user_id` = 5
AND `date` = '2026-02-04'
AND `time_entries`.`deleted_at` IS NULL
 LIMIT 1