app/Models/AlertModel.php

    public function getUserAlerts($userId)
    {
        return $this->where('user_id', $userId)
            ->where('is_resolved', 0)
            ->orderBy('severity', 'DESC')
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `alerts`
WHERE `user_id` = 5
AND `is_resolved` = 0
ORDER BY `severity` DESC, `created_at` DESC