app/Models/MessageModel.php

INSERT INTO `activity_logs` (`user_id`, `entity_type`, `entity_id`, `action`, `description`, `ip_address`, `user_agent`, `created_at`) VALUES (5, 'message', 2, 'created', 'Posted message', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:147.0) Gecko/20100101 Firefox/147.0', '2026-02-04 14:50:37')
---
    protected function logActivity(array $data)
    {
        $activityModel = new ActivityLogModel();

        if (isset($data['result']) && $data['result']) {
            $activityModel->insert([
                'user_id' => auth()->id() ?? 0,
                'entity_type' => 'message',
                'entity_id' => is_array($data['id']) ? $data['id'][0] : $data['id'],
                'action' => 'created',
                'description' => 'Posted message',
                'ip_address' => service('request')->getIPAddress(),
                'user_agent' => service('request')->getUserAgent()->getAgentString(),
            ]);

SELECT `messages`.*, `users`.`username`
FROM `messages`
JOIN `users` ON `users`.`id` = `messages`.`user_id`
WHERE `messages`.`project_id` = '1'
AND `messages`.`deleted_at` IS NULL
AND `messages`.`task_id` IS NULL
AND `messages`.`deleted_at` IS NULL
ORDER BY `messages`.`created_at` ASC
---
    public function getProjectMessages($projectId, $taskId = null)
    {
        $builder = $this->select('messages.*, users.username')
            ->join('users', 'users.id = messages.user_id')
            ->where('messages.project_id', $projectId)
            ->where('messages.deleted_at', null);

        if ($taskId) {
            $builder->where('messages.task_id', $taskId);
        } else {
            $builder->where('messages.task_id', null);
        }

        return $builder->orderBy('messages.created_at', 'ASC')->findAll();

SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `project_id` = '1'
AND `user_id` != 4
AND `is_read` = 0
AND `deleted_at` IS NULL
AND `messages`.`deleted_at` IS NULL
---
    public function getUnreadCount($projectId, $userId)
    {
        return $this->where('project_id', $projectId)
            ->where('user_id !=', $userId)
            ->where('is_read', 0)
            ->where('deleted_at', null)
            ->countAllResults();