app/Models/ProjectUserModel.php

SELECT `project_users`.*, `users`.`username`, `auth_identities`.`secret` as `email`
FROM `project_users`
JOIN `users` ON `users`.`id` = `project_users`.`user_id`
LEFT JOIN `auth_identities` ON `auth_identities`.`user_id` = `users`.`id`
WHERE `project_id` = '1'
AND `auth_identities`.`type` = 'email_password'
---
    public function getProjectUsers($projectId)
    {
        return $this->select('project_users.*, users.username, users.email')
            ->join('users', 'users.id = project_users.user_id')
            ->where('project_id', $projectId)
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `project_users`
WHERE `project_id` = '1'
AND `user_id` = 5
---
    public function isUserAssignedToProject($projectId, $userId)
    {
        return $this->where('project_id', $projectId)
            ->where('user_id', $userId)
            ->countAllResults() > 0;