app/Models/ProjectModel.php

SELECT `projects`.*, `clients`.`name` as `client_name`
FROM `projects`
JOIN `clients` ON `clients`.`id` = `projects`.`client_id`
WHERE `projects`.`deleted_at` IS NULL
SELECT `projects`.*, `clients`.`name` as `client_name`
FROM `projects`
JOIN `clients` ON `clients`.`id` = `projects`.`client_id`
JOIN `project_users` ON `project_users`.`project_id` = `projects`.`id`
WHERE `project_users`.`user_id` = 5
AND `projects`.`deleted_at` IS NULL
---
    public function getProjectsForUser($userId, $isAdmin = false)
    {
        if ($isAdmin) {
            return $this->select('projects.*, clients.name as client_name')
                ->join('clients', 'clients.id = projects.client_id')
                ->findAll();
        }

        return $this->select('projects.*, clients.name as client_name')
            ->join('clients', 'clients.id = projects.client_id')
            ->join('project_users', 'project_users.project_id = projects.id')
            ->where('project_users.user_id', $userId)
            ->findAll();

SELECT *
FROM `tasks`
WHERE `project_id` = '1'
AND `tasks`.`deleted_at` IS NULL
---
    public function getProjectHealth($projectId)
    {
        $taskModel = new TaskModel();
        $tasks = $taskModel->where('project_id', $projectId)->findAll();