app/Models/ProjectTemplateModel.php

SELECT *
FROM `project_templates`
WHERE `is_active` = 1
AND `deleted_at` IS NULL
AND `project_templates`.`deleted_at` IS NULL
ORDER BY `name` ASC
---
    public function getActiveTemplates()
    {
        return $this->where('is_active', 1)
            ->where('deleted_at', null)
            ->orderBy('name', 'ASC')
            ->findAll();