app/Models/TaskTemplateModel.php

    public function getActiveTemplates()
    {
        return $this->where('is_active', 1)
            ->where('deleted_at', null)
            ->orderBy('name', 'ASC')
            ->findAll();
---
SELECT *
FROM `task_templates`
WHERE `is_active` = 1
AND `deleted_at` IS NULL
AND `task_templates`.`deleted_at` IS NULL
ORDER BY `name` ASC