app/Models/TaskModel.php

SELECT `tasks`.*, `projects`.`name` as `project_name`, `users`.`username` as `assigned_to_name`
FROM `tasks`
JOIN `projects` ON `projects`.`id` = `tasks`.`project_id`
LEFT JOIN `users` ON `users`.`id` = `tasks`.`assigned_to`
WHERE `tasks`.`assigned_to` = 5
AND `tasks`.`deleted_at` IS NULL
---
    public function getTasksForUser($userId, $isAdmin = false)
    {
        $builder = $this->select('tasks.*, projects.name as project_name, users.username as assigned_to_name')
            ->join('projects', 'projects.id = tasks.project_id')
            ->join('users', 'users.id = tasks.assigned_to', 'left');

        if (!$isAdmin) {
            $builder->where('tasks.assigned_to', $userId);
        }

        return $builder->findAll();